import numpy as np
from scipy.optimize import linprog

wood_used = 2*x + 4*y
labor_used = 3*x + 2*y

wood_left = 120 - wood_used
labor_left = 90 - labor_used

print("Використано деревини:", wood_used, "залишок:", wood_left)
print("Використано робочого часу:", labor_used, "залишок:", labor_left)

#--------------------------------------
# Висновок: в оптимальному плані обидва ресурси є "вузькими місцями" (витрачаються на 100%). Або з точки зору досвіду, для збільшення Pmax, кращим висновком буде лінійне масштабізація бізнесу зі збільшенням (ресурсів)+(людей)+(вдосконалення виготовлення).
